create database if not exists lab_5;
use lab_5;

create table if not exists students(
	student_id int auto_increment primary key,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    patronymic VARCHAR(50) not null,
    date_of_birth date not null,
    student_card_number varchar(20) not null unique
);

insert into students (first_name, last_name, patronymic, date_of_birth, student_card_number)
values ('Дмитро', 'Бедловський', 'Сергійович', '2003-08-02', '3783404538'),
('Катерина', 'Середняк', 'Олександрівна', '2003-04-06', '3771608966'),
('Ян', 'Шелег', 'Павлович', '2003-05-06', '3774607090'),
('Діана', 'Самойленко', 'Андріївна', '2003-02-16', '3766701047'),
('Єгор', 'Лєвін', 'Олексійович', '2002-05-16', '3742210138'),
('Максим', 'Куць', 'Дмитрович', '2003-09-06', '3777709459'),
('Олександр', 'Пирогов', 'Іванович', '2003-07-26', '3782709653'),
('Варвара', 'Рябчинська', 'Олександрівна', '2002-12-26', '3761510443'),
('Ілля', 'Чертков', 'Миколайович', '2003-01-10', '3778107121'),
('Михайло', 'Юсипів', 'Сергійович', '2001-03-17', '3772105824'),
('Михайло', 'Зубков', 'Анатолійович', '2003-10-31', '3788601732'),
('Микола', 'Аксьонкін', 'Вікторович', '2002-11-02', '3769010479'),
('Ростислав', 'Глухих', 'Станіславович', '2003-05-17', '3773012084'),
('Іван', 'Поліков', 'Вадимович', '2003-05-13', '3786340281'),
('Вероніка', 'Кожушко', 'Олександрівна', '2004-01-02', '3790024589'),
('Антон', 'Корбань', 'Максимович', '2001-04-10', '3748204916'),
('Денис', 'Музичук', 'Євгенійович', '2003-07-03', '3778704421'),
('Іван', 'Піцик', 'Петрович', '2003-02-23', '3768709752'),
('Марія', 'Димарьова', 'Денисівна', '2002-11-22', '3779829456'),
('Данііл', 'Каліневич', 'Сергійович', '2003-12-04', '3778000450');